return {
  "folke/snacks.nvim",
  ---@type snacks.Config
  opts = {
    -- picker
    -- picker = {
    --     hidden = true,
    --     ignored = true,
    --     sources = {
    --         files = {
    --             hidden = true,
    --             ignored = true,
    --         },
    --     },
    -- },

    -- dashboard
    dashboard = {
      enabled = true,
      preset = {
        header = table.concat({
          " ██████╗  ██████╗ ████████╗ ██████╗██╗  ██╗ █████╗ ██╗",
          "██╔════╝ ██╔═══██╗╚══██╔══╝██╔════╝██║  ██║██╔══██╗██║",
          "██║  ███╗██║   ██║   ██║   ██║     ███████║███████║██║",
          "██║   ██║██║   ██║   ██║   ██║     ██╔══██║██╔══██║╚═╝",
          "╚██████╔╝╚██████╔╝   ██║   ╚██████╗██║  ██║██║  ██║██╗",
          " ╚═════╝  ╚═════╝    ╚═╝    ╚═════╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝",
          "                                         -- Chue      ",
        }, "\n"),
      },
    },
  },
}
